from hash_table_func import *

h = HashTable()
h.addKV('Богдан', '(096) 030-48-89')
h.addKV('Марія', '(063) 789-45-11')
h.addKV('Марія', '(095) 145-24-14')
h.addKV('Аня', '(098) 254-69-15')
h.addKV('Аліна', '(097) 369-96-45')
h.addKV('Аліса', '(073) 741-36-36')
h.addKV('Мирослава', '(066) 852-87-01')
h.addKV('Аліна', '(099) 258-22-00')
h.printTable()	

h.deleteKey('Богдан')
print("\nТелефонний довідник після видалення 'Богдан':")
h.printTable()

print("\nОтримане значення ключа 'Марія':")
print('Марія: ' + h.getKey('Марія'))